<a href="https://colab.research.google.com/github/LucasCavalcanteSantos/AI/blob/main/Pre_processamento_de_dados.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd

In [3]:
dic = {'Nome':['Isa','Peter','Rico'],
       'Idade':['19', '28', '0'],
       'Salário':['19000', '5000', '100'],
       'Gênero':['F', 'M', 'honda4porta'],
       'Cargo':['Gerente', 'Supervisor','']
}

In [4]:
df = pd.DataFrame(dic)
df

    Nome Idade Salário       Gênero       Cargo
0    Isa    19   19000            F     Gerente
1  Peter    28    5000            M  Supervisor
2   Rico     0     100  honda4porta

In [5]:
print(df)

    Nome Idade Salário       Gênero       Cargo
0    Isa    19   19000            F     Gerente
1  Peter    28    5000            M  Supervisor
2   Rico     0     100  honda4porta

In [6]:
df.info

<bound method DataFrame.info of     Nome Idade Salário       Gênero       Cargo
0    Isa    19   19000            F     Gerente
1  Peter    28    5000            M  Supervisor
2   Rico     0     100  honda4porta            >

In [ ]:
df = pd.get_dummies(df, columns=['Gênero']) #não rodar duas vezes, pois já foi

In [11]:
df

    Nome Idade Salário       Cargo  Gênero_F  Gênero_M  Gênero_honda4porta
0    Isa    19   19000     Gerente         1         0                   0
1  Peter    28    5000  Supervisor         0         1                   0
2   Rico     0     100                     0         0                   1

In [13]:
df = df.drop(columns=['Cargo'])

In [14]:
df

    Nome Idade Salário  Gênero_F  Gênero_M  Gênero_honda4porta
0    Isa    19   19000         1         0                   0
1  Peter    28    5000         0         1                   0
2   Rico     0     100         0         0                   1